# ภารกิจที่ 2: "ตามล่าหาข้อมูลพนักงานที่หลุดรอด" (หมวด Regex & Web Scraping)
# สถานการณ์:
# หน้าเว็บของบริษัทเป้าหมายที่ http://127.0.0.1:5000/about-us มีรายชื่อพนักงานและข้อมูลแผนกต่างๆ ยาวเหยียด คุณสงสัยว่าฝ่าย IT อาจจะเผลอทิ้ง หมายเลขโทรศัพท์ภายใน (รูปแบบ XXX-XXX-XXXX) ไว้ในหน้าเว็บนี้ ซึ่งอาจเป็นประโยชน์ในการทำ Social Engineering
# โจทย์ที่คุณต้องเขียนโค้ด:
# จงเขียนสคริปต์ใช้ requests ดึงข้อมูลหน้าเว็บนั้นมา จากนั้นใช้ไลบรารี re (Regular Expression) เพื่อค้นหาและดึง "หมายเลขโทรศัพท์ทั้งหมด" ที่มีรูปแบบเป็น ตัวเลข 3 ตัว ขีดกลาง ตัวเลข 3 ตัว ขีดกลาง ตัวเลข 4 ตัว ออกมาแสดงผลทีละบรรทัด โดยไม่ให้มีเบอร์ซ้ำกัน
# 💡 คำใบ้ (Hint):
# Pattern ของ Regex สำหรับเบอร์โทรนี้คือ r'\d{3}-\d{3}-\d{4}'
# ใช้ re.findall() แล้วนำผลลัพธ์ไปใส่ใน set() เพื่อลบตัวซ้ำ

import requests
import re

url="http://127.0.0.1:5000/about-us"

data=requests.get(url)
pattern = r"\d{3}-\d{3}-\d{4}"
match_data=re.findall(pattern,data.text)

match_data=set(match_data)

cnt=0
for i in match_data:
    print(f"ข้อมูลเบอร์โทรศัพท์ที่เจอ เบอร์ที่ : {cnt} คือ {i}")
    cnt+=1